In [3]:
import pandas as pd
path = r"C:\Users\Ravin\Downloads\Orders-With Nulls.xlsx"
df = pd.read_excel(path)
print(df)

    Order ID Order Date  Order Quantity      Sales       Ship Mode
0          3 2010-10-13               6   261.5400     Regular Air
1          6 2012-02-20               2     6.9300     Regular Air
2         32 2011-07-15              26  2808.0800     Regular Air
3         32 2011-07-15              24  1761.4000  Delivery Truck
4         32 2011-07-15              23   160.2335     Regular Air
5         32 2011-07-15              15   140.5600     Regular Air
6         35 2011-10-22              30   288.5600     Regular Air
7         35 2011-10-22              14  1892.8480     Regular Air
8         36 2011-11-02              46  2484.7455     Regular Air
9         65 2011-03-17              32  3812.7300     Regular Air
10        50        NaT              40        NaN     Regular Air

In [4]:
df.head(5)

   Order ID Order Date  Order Quantity      Sales       Ship Mode
0         3 2010-10-13               6   261.5400     Regular Air
1         6 2012-02-20               2     6.9300     Regular Air
2        32 2011-07-15              26  2808.0800     Regular Air
3        32 2011-07-15              24  1761.4000  Delivery Truck
4        32 2011-07-15              23   160.2335     Regular Air

In [7]:
headers = ["Sno","Date","Qty","Sale","Mode"]
df.columns = headers

In [9]:
print(df)

    Sno       Date  Qty       Sale            Mode
0     3 2010-10-13    6   261.5400     Regular Air
1     6 2012-02-20    2     6.9300     Regular Air
2    32 2011-07-15   26  2808.0800     Regular Air
3    32 2011-07-15   24  1761.4000  Delivery Truck
4    32 2011-07-15   23   160.2335     Regular Air
5    32 2011-07-15   15   140.5600     Regular Air
6    35 2011-10-22   30   288.5600     Regular Air
7    35 2011-10-22   14  1892.8480     Regular Air
8    36 2011-11-02   46  2484.7455     Regular Air
9    65 2011-03-17   32  3812.7300     Regular Air
10   50        NaT   40        NaN     Regular Air

In [11]:
df["Qty"]=df["Qty"]+1 #adding +1 to qty column

In [13]:
print(df)

    Sno       Date  Qty       Sale            Mode
0     3 2010-10-13    7   261.5400     Regular Air
1     6 2012-02-20    3     6.9300     Regular Air
2    32 2011-07-15   27  2808.0800     Regular Air
3    32 2011-07-15   25  1761.4000  Delivery Truck
4    32 2011-07-15   24   160.2335     Regular Air
5    32 2011-07-15   16   140.5600     Regular Air
6    35 2011-10-22   31   288.5600     Regular Air
7    35 2011-10-22   15  1892.8480     Regular Air
8    36 2011-11-02   47  2484.7455     Regular Air
9    65 2011-03-17   33  3812.7300     Regular Air
10   50        NaT   41        NaN     Regular Air

In [15]:
df["Qty"]=df["Qty"]-1
print(df)

    Sno       Date  Qty       Sale            Mode
0     3 2010-10-13    6   261.5400     Regular Air
1     6 2012-02-20    2     6.9300     Regular Air
2    32 2011-07-15   26  2808.0800     Regular Air
3    32 2011-07-15   24  1761.4000  Delivery Truck
4    32 2011-07-15   23   160.2335     Regular Air
5    32 2011-07-15   15   140.5600     Regular Air
6    35 2011-10-22   30   288.5600     Regular Air
7    35 2011-10-22   14  1892.8480     Regular Air
8    36 2011-11-02   46  2484.7455     Regular Air
9    65 2011-03-17   32  3812.7300     Regular Air
10   50        NaT   40        NaN     Regular Air

In [17]:
df.tail(5)

    Sno       Date  Qty       Sale         Mode
6    35 2011-10-22   30   288.5600  Regular Air
7    35 2011-10-22   14  1892.8480  Regular Air
8    36 2011-11-02   46  2484.7455  Regular Air
9    65 2011-03-17   32  3812.7300  Regular Air
10   50        NaT   40        NaN  Regular Air

In [19]:
import numpy as np
df["Sale"].replace(np.nan,4000)

0      261.5400
1        6.9300
2     2808.0800
3     1761.4000
4      160.2335
5      140.5600
6      288.5600
7     1892.8480
8     2484.7455
9     3812.7300
10    4000.0000
Name: Sale, dtype: float64

In [21]:
df.dropna() #drop the row which does have nat or nan value

   Sno       Date  Qty       Sale            Mode
0    3 2010-10-13    6   261.5400     Regular Air
1    6 2012-02-20    2     6.9300     Regular Air
2   32 2011-07-15   26  2808.0800     Regular Air
3   32 2011-07-15   24  1761.4000  Delivery Truck
4   32 2011-07-15   23   160.2335     Regular Air
5   32 2011-07-15   15   140.5600     Regular Air
6   35 2011-10-22   30   288.5600     Regular Air
7   35 2011-10-22   14  1892.8480     Regular Air
8   36 2011-11-02   46  2484.7455     Regular Air
9   65 2011-03-17   32  3812.7300     Regular Air

In [23]:
df.drop([9],axis=0) #drops the row 9 and axis '0' means row '1' means column

    Sno       Date  Qty       Sale            Mode
0     3 2010-10-13    6   261.5400     Regular Air
1     6 2012-02-20    2     6.9300     Regular Air
2    32 2011-07-15   26  2808.0800     Regular Air
3    32 2011-07-15   24  1761.4000  Delivery Truck
4    32 2011-07-15   23   160.2335     Regular Air
5    32 2011-07-15   15   140.5600     Regular Air
6    35 2011-10-22   30   288.5600     Regular Air
7    35 2011-10-22   14  1892.8480     Regular Air
8    36 2011-11-02   46  2484.7455     Regular Air
10   50        NaT   40        NaN     Regular Air

In [25]:
print(df)

    Sno       Date  Qty       Sale            Mode
0     3 2010-10-13    6   261.5400     Regular Air
1     6 2012-02-20    2     6.9300     Regular Air
2    32 2011-07-15   26  2808.0800     Regular Air
3    32 2011-07-15   24  1761.4000  Delivery Truck
4    32 2011-07-15   23   160.2335     Regular Air
5    32 2011-07-15   15   140.5600     Regular Air
6    35 2011-10-22   30   288.5600     Regular Air
7    35 2011-10-22   14  1892.8480     Regular Air
8    36 2011-11-02   46  2484.7455     Regular Air
9    65 2011-03-17   32  3812.7300     Regular Air
10   50        NaT   40        NaN     Regular Air

In [27]:
df['Date'].fillna(pd.Timestamp('2000-01-01')) #fill the NaT in Date column with particular date

0    2010-10-13
1    2012-02-20
2    2011-07-15
3    2011-07-15
4    2011-07-15
5    2011-07-15
6    2011-10-22
7    2011-10-22
8    2011-11-02
9    2011-03-17
10   2000-01-01
Name: Date, dtype: datetime64[ns]

In [29]:
df["Qty"]=df["Qty"]/2

In [31]:
df.head(5)

   Sno       Date   Qty       Sale            Mode
0    3 2010-10-13   3.0   261.5400     Regular Air
1    6 2012-02-20   1.0     6.9300     Regular Air
2   32 2011-07-15  13.0  2808.0800     Regular Air
3   32 2011-07-15  12.0  1761.4000  Delivery Truck
4   32 2011-07-15  11.5   160.2335     Regular Air

In [35]:
df.rename(columns={"Mode":"Transportation"})

    Sno       Date   Qty       Sale  Transportation
0     3 2010-10-13   3.0   261.5400     Regular Air
1     6 2012-02-20   1.0     6.9300     Regular Air
2    32 2011-07-15  13.0  2808.0800     Regular Air
3    32 2011-07-15  12.0  1761.4000  Delivery Truck
4    32 2011-07-15  11.5   160.2335     Regular Air
5    32 2011-07-15   7.5   140.5600     Regular Air
6    35 2011-10-22  15.0   288.5600     Regular Air
7    35 2011-10-22   7.0  1892.8480     Regular Air
8    36 2011-11-02  23.0  2484.7455     Regular Air
9    65 2011-03-17  16.0  3812.7300     Regular Air
10   50        NaT  20.0        NaN     Regular Air

In [37]:
df.dtypes

Sno              int64
Date    datetime64[ns]
Qty            float64
Sale           float64
Mode            object
dtype: object

In [39]:
df

    Sno       Date   Qty       Sale            Mode
0     3 2010-10-13   3.0   261.5400     Regular Air
1     6 2012-02-20   1.0     6.9300     Regular Air
2    32 2011-07-15  13.0  2808.0800     Regular Air
3    32 2011-07-15  12.0  1761.4000  Delivery Truck
4    32 2011-07-15  11.5   160.2335     Regular Air
5    32 2011-07-15   7.5   140.5600     Regular Air
6    35 2011-10-22  15.0   288.5600     Regular Air
7    35 2011-10-22   7.0  1892.8480     Regular Air
8    36 2011-11-02  23.0  2484.7455     Regular Air
9    65 2011-03-17  16.0  3812.7300     Regular Air
10   50        NaT  20.0        NaN     Regular Air

In [41]:
df.drop([10],axis=0,inplace=True)

In [45]:
df

   Sno       Date   Qty       Sale            Mode
0    3 2010-10-13   3.0   261.5400     Regular Air
1    6 2012-02-20   1.0     6.9300     Regular Air
2   32 2011-07-15  13.0  2808.0800     Regular Air
3   32 2011-07-15  12.0  1761.4000  Delivery Truck
4   32 2011-07-15  11.5   160.2335     Regular Air
5   32 2011-07-15   7.5   140.5600     Regular Air
6   35 2011-10-22  15.0   288.5600     Regular Air
7   35 2011-10-22   7.0  1892.8480     Regular Air
8   36 2011-11-02  23.0  2484.7455     Regular Air
9   65 2011-03-17  16.0  3812.7300     Regular Air

In [51]:
df.rename(columns={"Mode":"Transportation"},inplace=True)
df

   Sno       Date   Qty       Sale  Transportation
0    3 2010-10-13   3.0   261.5400     Regular Air
1    6 2012-02-20   1.0     6.9300     Regular Air
2   32 2011-07-15  13.0  2808.0800     Regular Air
3   32 2011-07-15  12.0  1761.4000  Delivery Truck
4   32 2011-07-15  11.5   160.2335     Regular Air
5   32 2011-07-15   7.5   140.5600     Regular Air
6   35 2011-10-22  15.0   288.5600     Regular Air
7   35 2011-10-22   7.0  1892.8480     Regular Air
8   36 2011-11-02  23.0  2484.7455     Regular Air
9   65 2011-03-17  16.0  3812.7300     Regular Air

In [55]:
df.dtypes

Sno                        int64
Date              datetime64[ns]
Qty                      float64
Sale                     float64
Transportation            object
dtype: object

In [59]:
df["Transportation"]=df["Transportation"].astype("string")

In [63]:
df

   Sno       Date   Qty       Sale  Transportation
0    3 2010-10-13   3.0   261.5400     Regular Air
1    6 2012-02-20   1.0     6.9300     Regular Air
2   32 2011-07-15  13.0  2808.0800     Regular Air
3   32 2011-07-15  12.0  1761.4000  Delivery Truck
4   32 2011-07-15  11.5   160.2335     Regular Air
5   32 2011-07-15   7.5   140.5600     Regular Air
6   35 2011-10-22  15.0   288.5600     Regular Air
7   35 2011-10-22   7.0  1892.8480     Regular Air
8   36 2011-11-02  23.0  2484.7455     Regular Air
9   65 2011-03-17  16.0  3812.7300     Regular Air

In [67]:
df.dtypes

Sno                        int64
Date              datetime64[ns]
Qty                      float64
Sale                     float64
Transportation    string[python]
dtype: object

In [69]:
print(df)

   Sno       Date   Qty       Sale  Transportation
0    3 2010-10-13   3.0   261.5400     Regular Air
1    6 2012-02-20   1.0     6.9300     Regular Air
2   32 2011-07-15  13.0  2808.0800     Regular Air
3   32 2011-07-15  12.0  1761.4000  Delivery Truck
4   32 2011-07-15  11.5   160.2335     Regular Air
5   32 2011-07-15   7.5   140.5600     Regular Air
6   35 2011-10-22  15.0   288.5600     Regular Air
7   35 2011-10-22   7.0  1892.8480     Regular Air
8   36 2011-11-02  23.0  2484.7455     Regular Air
9   65 2011-03-17  16.0  3812.7300     Regular Air